Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/src/mem/r_sdc_sdmem_write.c
        r_sdc_sd_disable_icu_int(card_no);
        r_sdc_sd_set_int_mask(card_no, SDHI_SDIMSK1_DATA_TRNS, 0);
        r_sdc_sd_enable_icu_int(card_no);
    }

    /* ---- Wait All end interrupt. ---- */
    ret = r_sdc_sd_int_mem_wait(card_no, SDC_SD_TIMEOUT_RESP);

    if ((SDC_SD_MODE_DMA | SDC_SD_MODE_DTC) & p_sdc_sd_access->mode)
    {
        r_sdc_sd_disable_icu_int(card_no);
        r_sdc_sd_set_int_mask(card_no, sdsts1_back, 0);
        r_sdc_sd_enable_icu_int(card_no);
    }

    /* ---- Check the result of transfer. ---- */
    if (SDC_SD_SUCCESS != trans_ret)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_WRITE, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return p_hndl->error;
    }

    /* ---- Check the result of wait All end interrupt. ---- */
    if (SDC_SD_SUCCESS != ret)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_WRITE, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_HOST_TOE);
        r_sdc_sdmem_read_write_error(card_no);
        return p_hndl->error;
    }

    /* ---- Check errors. ---- */
    if (p_hndl->sdsts2 & SDHI_SDIMSK2_ERR)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_WRITE, __LINE__);
        r_sdc_sd_check_sdsts2_err(card_no);
        r_sdc_sdmem_read_write_error(card_no);
        return p_hndl->error;
    }

    /* Disable All end, BWE and errors. */
    r_sdc_sd_disable_icu_int(card_no);
    r_sdc_sd_clear_int_mask(card_no, SDHI_SDIMSK1_DATA_TRNS, SDHI_SDIMSK2_BWE);
    r_sdc_sd_enable_icu_int(card_no);

    /* Clear All end bits. */
    r_sdc_sd_clear_sdsts(card_no, SDHI_SDIMSK1_DATA_TRNS, 0);

    if (0x01 != p_sdc_sd_access->cnt)
    {
        if (p_hndl->media_type & SDC_SD_MEDIA_SDMEM)
        {
            /* Check the response after CMD12. */
            if(r_sdc_sd_get_resp(card_no, SDC_SD_RESP_R1) != SDC_SD_SUCCESS)
            {
                /* Check the number of write complete block. */
                if(r_sdc_sdmem_read_byte(card_no, SDC_SD_ACMD22, 0, wb, 4) != SDC_SD_SUCCESS)
                {
                    SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_WRITE, __LINE__);
                    r_sdc_sdmem_read_write_error(card_no);
                    return p_hndl->error;
                }
                /* Type cast (uint32_t) remove compiler dependence. */
                writeblock = ((uint32_t)wb[0] << SDC_SD_BIT_SHIFT_24) | 
                             ((uint32_t)wb[1] << SDC_SD_BIT_SHIFT_16) | 
                             ((uint32_t)wb[2] << SDC_SD_BIT_SHIFT_8)  |
                             (uint32_t)wb[3];
                if (p_sdc_sd_access->cnt != writeblock)  /* No write complete block */
                {
                    SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_WRITE, __LINE__);
                    r_sdc_sd_set_err(card_no, SDC_SD_ERR);
                    r_sdc_sdmem_read_write_error(card_no);
                    return p_hndl->error;
                }
            }
        }
    }

    /* ==== Check the status after write operation. ==== */
    if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD13, SDC_SD_RESP_R1, p_hndl->rca[0]) != SDC_SD_SUCCESS)
    {
        /* Check OUT_OF_RANGE error. */
        /* ignore errors during last block access */
        if (p_hndl->resp_status & SDC_SD_RES_ERR)
        {
            if ((p_sdc_sd_access->lbn + p_sdc_sd_access->cnt) != p_hndl->card_sector_size)
            {
                /* Not last block */
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_WRITE, __LINE__);
                r_sdc_sdmem_read_write_error(card_no);
                return p_hndl->error;
            }
            if (p_hndl->resp_status & SDC_SD_RES_ERR_IGNORE_OUT_OF_RAGE)
            {
                /* Not OUT_OF_RANGE error */
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_WRITE, __LINE__);
                r_sdc_sdmem_read_write_error(card_no);
                return p_hndl->error;
            }
            /* Clear OUT_OF_RANGE error. */
            p_hndl->resp_status = (p_hndl->resp_status & (SDC_SD_RES_STATE | SDC_SD_RES_READY_FOR_DATA));
            p_hndl->error = SDC_SD_SUCCESS;
        }
        else    /* SDHI error, ex)timeout error so on */
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_WRITE, __LINE__);
            r_sdc_sdmem_read_write_error(card_no);
            return p_hndl->error;
        }
    }

    if (SDC_SD_STATE_TRAN != (p_hndl->resp_status & SDC_SD_RES_STATE))
    {
        p_hndl->error = SDC_SD_ERR;
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_WRITE, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
    }

    return p_hndl->error;
} /* End of function r_sdc_sdmem_write_sect_sub() */
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM) */

/* End of File */
